# BentFabricParamLongitudinalCutLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BentFabricParamLongitudinalCutLength Property
ParameterTypeId Class See Also
---
"Longitudinal Cut Length": Bent fabric longitudinal cut length.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BentFabricParamLongitudinalCutLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BentFabricParamLongitudinalCutLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BentFabricParamLongitudinalCutLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace